{
    "courseInfo": {
        "title": "Pastoral Leadership in a Post-Christian Culture",
        "subTitle": "Jesus Collective Online Learning Collectie Pilot",
        "designed": "Designed in collaboration with Jesus Collective by Dr. Brian Ross of Fresno Pacific Biblical Seminary",
        "instructor": {
            "name": "Jon Hand, MDiv",
            "email": "jon.hand@jesuscollective.com",
            "phone": "289-697-3353"
        }
    },
    "introduction": [
        "Pastoral Leadership in a Post-Christian Culture",
        "Specifically, we are assuming that effective contemporary ministry leadership, within Western Culture, is better understood as serving as a cross-cultural missionary rather than as a traditional pastor (i.e. chaplain). This intensive draws upon multiple perspectives in order to offer a clearer picture of the contemporary challenges, opportunities, and specific calling of North American church leaders. In short, we are not attempting to simply lead lapsed Jesus followers (A.K.A., Dones)  back onto the narrow road; we are attempting to make Jesus disciples out of people who have a completely different religious orientation called Secularism.",
        "Before you jump in, let’s take a moment to review just a few of the guiding principles of the learning intensive process…",
        "Communal. The Jesus Collective believes in the priesthood of all believers and that the community of Jesus followers serve as his body- his current physical manifestation on earth. Therefore, this Learning Collective has intentionally been designed to facilitate ample interaction between you and other Jesus following colleagues. You will be asked to consistently share your reflections and thoughts with others in the cohort, to comment on others’ thoughts and reflections, and others will comment on yours. Obviously, we trust that all statements will be made in a spirit of others-centered love and certainly no rude or offensive communication will be tolerated. However, we also serve our brothers and sisters by speaking clearly and honestly, and sometimes, this may even mean disagreeing with them.",
        "We trust that you will make some connections with new friends- that will last well beyond our six weeks together. However, we also trust that you are expecting to be stretched and challenged by your peers and that you will experience real change through the gifts of others.",
        "Confidential. This Learning Collective is designed to be a safe place for you to have some amazingly honest and reflective conversations that you may or may not otherwise be able to have in your ministry context. The success of this Online Learning Collective (OLC) will be our ability to be honest, open, and even vulnerable at times with each other. Therefore, it is vital that this be a place that honours confidentiality.  What happens in the OLC stays in the OLC! You will need to seek express permission from other participants to share ideas, thoughts, quotes, etc. of what is spoken or written within the OLC if want to share those things with others outside of this OLC.",
        "Commitment. We know that you are busy. We know that you have friends, and family members, and neighbors that you are committed to. We know that you are engaged in serious kingdom-oriented ministry and that you have a full schedule. And yet…",
        "For the learning intensive to be effective, possibly even transformative- you must be “all in” for the next six weeks together. The more you put into it, the more you will get out of it. We can assure you that we have worked hard to avoid any “busy work” in this experience, but it will still be demanding of your time. (This is why the intensive only runs for six-weeks, it would not be sustainable for an indefinite period of time.) ",
        "Our suggestion? Cut out Netflix, longer workouts at the gym, and all additional reading/learning from other sources for the next month and a half. You can complete this intensive- but you will have to use your time wisely. We believe the commitment and sacrifice will be worth it, but please know that since this is a communal cohort-based program, everyone is learning from the investment of everyone else. If you miss the deadline for more than one activity, you will need to have a personal conversation with a Jesus Collective OLC leadership, and you may be asked to discontinue this OLC. Life happens and urgent things pop up, please stay in contact with Jon Hand if you will miss an assignment. If you miss more than two assignments without conversation, you may be asked to remove yourself from the OLC. ",
        "Refunds: If you begin the OLC and decide for whatever reason that it is not for you or you are asked by OLC leadership to remove yourself (due to missing assignments), you will receive a full refund if removal happens by October 22nd. You will receive half refund if removal is between October 16 and October 29. After October 29 no further refunds will be available. ",
        "Contextual. We know that there is no such thing as “one size fits all” within kingdom ministry. Consistency with the teaching and vision of Jesus will look somewhat different, and manifest itself in different forms, depending on the local community and/or the details of an individual’s life. ",
        "If you were expecting to learn the “right answers” in this intensive- you may be somewhat disappointed! But if you stay open, and stick with the process, we trust the Spirit of Jesus will supply something that you needed through this intensive that you can put to use in your very specific local context.",
        "Critical Reflection. This is not public-school where the teachers supply you with the right information and your job is to merely memorize it and then regurgitate it for a test. This is an adult formational experience. We fully expect that you will often disagree with invited thought leaders, with presentations that you may watch, and with texts that you will read. We expect as a loving and yet prophetic people- that you will even disagree with one another. ",
        "We will communicate with one another in thoughtful and kind and in appropriate others’ centered ways. But we will not confuse “peace-loving” with bland agreement.",
        "Coaching. When Jesus, the risen Son of God, walked physically upon the earth- he did not take the posture of a scholar. (Though they were often the ones he debated with the most!) Jesus lived as a lover of God and a lover of people; as a spiritual master who called and invested in disciples, who were tasked with making other disciples.",
        "In this spirit, personal and group coaching will be integral to this six-week intensive. Sure, there may be only so much that one can explore about their personal life and/or their local ministry over forty-two days, but we will still make this a priority. In alternating weeks, you will either connect with a personal coach for 1.25 hours to discuss what is going on within you, or you will connect with a coach as part of a Triad of participants for 1.5 hours in order to discuss what is going on within your local ministry. We are not seeking to exist as mere thinkers together, but as actual lovers of God and people.",
        "How to come prepared for coaching and triads. ",
        "Coaching is less about an outside ‘expert’ giving you answers to the challenges you face and more about holding up a mirror to your life and context to help you discern clarity on what you need to do to move forward or what Jesus might be doing in you (or your context) as you move forward. ",
        "For your personal coaching sessions you will need to come prepared with a clearly articulated challenge you are facing in your ministry context or an aspect of your own self-leadership that you would like to confidentially process with the coach.  ",
        "Examples:",
        "By the end of our conversation today I would like to identify the next step(s) I can take to help my elders think about ministry outside our church walls.",
        "By the end of our conversation today I would like to gain one or two insights about what is holding me back from being vulnerable with my staff team.",
        "For your triad coaching sessions you will need to come prepared with questions/issues you are wrestling with from the course content / theme as it applies to your ministry context.  We are also asking you to come with a willingness to give and receive freely with the others in your triad.  This is a space for vulnerability, allowing others to ask you open ended questions, gain valuable insights from others, and allow the Spirit to speak into your life through the conversation. "
    ],
    
    "courseDetails": [
        {
            "week": "Week 1",
            "date": "October 15-22",
            "leader": "Bruxy Cavey",
            "events": [
                {
                    "name": "Introductory Community Experience",
                    "time": "October 15 1-4 est",
                    "description": [
                        "During this initial connection point- we will get to know one another within the cohort, answer any questions about the learning intensive you may have, and spend time in prayer together. Community is essential to being formed in the Way of Jesus!",
                        "Preparation:",
                        "Come ready to share your personal story for a solid ten minutes with the cohort. Cover details such as: where you grew up, any specifics of your family of origin, when you began to follow Jesus, where you currently live, your current ministry context with its strengths and weaknesses, why you signed up for this intensive, etc. Additionally, expect that some will ask some follow up questions as they seek to get to know you better.",
                        "After exploring the learning intensive schedule and plan- write down any questions you have and be ready to ask those in our live Zoom session for the benefit of the entire cohort."
                    ]
                },
                {
                    "name": "Engaging & Responding to a Thought Leader / Practitioner",
                    "time": "October 16 1-2:30 est",
                    "description": [
                        "Today we will have the opportunity to engage in an open Questions & Response session with Bruxy Cavey, for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask Bruxy regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together. Bruxy will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Responsive Post:",
                            "Write a two-hundred-word response to what you heard from Bruxy Cavey today under the W1 Responsive Post section found with the Modules tab. What you specifically write about is up to you. It could involve something specific that they said which you clearly agreed with, or strongly disagreed with. It could surround something that the Spirit of God brought to your mind during the discussion, a question that you are left with after today’s interaction, or even regarding something specific that someone else in the cohort mentioned in the post-conversation cohort interaction."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Posts",
                    "time": "October 17",
                    "description": [
                        "Today you will continue the conversation with your cohort with the Pathways digital platform based on yesterday’s conversation with Bruxy Cavey.  Please write today’s post by clicking on the Modules tab and then W1 Responsive Post."
                    ],
                    "assignment": {
                        "due": "Midnight, October 17",
                        "description": [
                            "Responding to Other Learners:",
                            "Write a fifty-word word response, to three other learners’ posts from yesterday. Please add to the conversation with something more substantive than “Hey, you are right, and I agree with you- thanks!” Reflect (briefly) on something specific from their post that deeply spoke to you and why, or why you kindly disagree with them on a specific point that they made, or even how you may specifically attempt to implement their main idea within your own life or ministry. "
                        ]
                    }
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas ",
                    "time": "October 18 & 19",
                    "description": [
                        "For these two days, we will carve out time to read some pieces and/or watch some video presentations from some essential thought leaders that have relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Friday & Saturday:",
                        "Book Review: The Abolition of Man - by C.S. Lewis. The Presbyformed Blog gives an overview of Lewis’ book to start you out on the big picture point Lewis is making in this book. https: //presbyformed.com/2016/10/13/book-review-the-abolition-of-man-by-c-s-lewis/",
                        "The Abolition of Man: A Book Study with Dr. Stephen Turley. This is a brief overview of AOM defining key terms in the book with a breakdown of each of the 3 lectures the book is based upon. This guide highlights Lewis’ main point: secular education teaches ‘how’ and ‘what’ but gives no ultimate ‘why’ for life. All of our higher morality and meaning as a civilization flows out of the ‘why’.  We know our ultimate ‘why’ is found in Jesus but Lewis is making the point that throughout history the great moral traditions have taught ultimate meaning and morality  is found in the Transcendent, until now. ",
                        "https: //www.classicalu.com/wp-content/uploads/2017/09/Abolition-of-Man-Lecture-Notes.pdf",
                        "The Abolition of Man by C.S. Lewis. A small book, based on three lectures, Lewis explores how modern Western culture has left historical faith behind and that what we consider “progress” often results in our self- destruction. A short read, but a dense one. Be prepared to be challenged and maybe frustrated as you wrestle with Lewis’ content and meandering ways he makes his point. There is a method to our madness, so be patient, curious, and open as you read. "
                    ],
                    "assignment": {
                        "due": "Midnight, October 19",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred-word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W1 Personal Learning Reflection section under the Modules tab.  In particular, explore the possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "October 20",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Spend some time slowly, and prayerfully, meditating on the biblical passages listed below. Pay attention to the personal feelings/gut reactions that emerge from within you. How do you emotionally feel about these texts and WHY? Do you find them exciting? Anxiety-provoking? Off-putting? Frustrating? Confusing? Challenging? Etc.",
                        "Genesis 12: 2-3",
                        "Isaiah 2: 2-3",
                        "Isaiah 42: 6-7 & 49: 6",
                        "Matthew 28: 18-20",
                        "Luke 10: 2-11",
                        "Luke 19: 7-10",
                        "1 Corinthians 9: 19-22"
                    ],
                    "assignment": {
                        "due": "Midnight, October 19",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred-word spiritual reflection, based on your experiences with the Spirit of Jesus today.  Please type this into the W1 Personal Spiritual Reflection section under the Modules tab.  In particular, write about what Jesus may want to do, or may already be doing, within your personal life. "
                        ]
                    }
                },
                {
                    "name": "Coaching and Responses to Other Cohort Members’ Learning & Spiritual Reflections",
                    "time": "October 20",
                    "description": [
                        "COACHING THIS WEEK ",
                        "Group One and Two Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups Three and Four: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss. The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "Midnight, October 21",
                        "description": [
                            "Today you will respond to cohort members’ learning reflections and spiritual reflections based on their posted reflections from Saturday and Sunday. ",
                            "Post 1. Responding to Learning Reflections:",
                            "Write a fifty-word response each to three other cohort members’ learning reflections from Saturday. Aim at a critical engagement with their reflection. Something like: “I hear you saying _________, I think you are on to something with ____________, but I also think you need to consider ______________.” Please do not simply agree with them. In this exercise, you are ministering to your fellow learners by adding some perspective that they may be missing. They will not be formed the same way if you merely agree with everything within their reflection. ",
                            "Post under Post 1 - Responding to Week 1 Personal Learning Reflections under Modules.",
                            "Post 2. Responding to a Spiritual Reflection:",
                            "Write a fifty-word response to one other cohort members’ spiritual reflection from Sunday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by prayerfully adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 2 - Responding to Week 1 Personal Spiritual Reflections under Modules."
                        ]
                    }
                },
                {
                    "name": "Learning From Others’ Feedback",
                    "time": "October 22",
                    "description": [
                        "Today, we will invest some time considering and responding to the feedback we received from others regarding our Learning Reflection and on our Spiritual Reflection. The purpose of this exercise is for us to hear from God through the gifts and perspectives of others. (And to learn to humbly respond to the larger community of Jesus and not merely live as a Western individualist!)"
                    ],
                    "assignment": {
                        "due": "Midnight, October 21",
                        "description": [
                            "Personal Learning Reflection:",
                            "Edit your three-hundred-word learning reflection, based on the feedback you received from three cohort members. (Cut some things out, add other things- basically edit the document as if you took seriously the fellow students’ feedback and then re-post it under W1 Personal Learning Reflection 2.0 under Modules.",
                            "Personal Spiritual Reflection- 2.0:",
                            "Edit you two-hundred word spiritual reflection, based on the pastoral feedback you received from a cohort member. (Cut some things out, add other things- basically edit it as if you took to heart their counsel and then re-post it under W1 Personal Spiritual Reflections 2.0 under Modules."
                        ]
                    }
                }
            ]
        },
        {
            "week": "Week 2",
            "date": "October 23-29",
            "leader": "Kyuboem Lee",
            "events": [
                {
                    "name": "Engaging & Responding to a Thought Leader",
                    "time": "October 23,2019 (Live Zoom Session) 1: 00 - 2: 30 PM EST",
                    "description": [
                        "Today we will have the opportunity to engage in an open Questions & Response session with Kyuboem Lee, for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask Kyuboem regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together. Kyuboem Lee will not be presenting any formal material but will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant."
                    ],
                    "assignment": {
                        "due": " By Midnight, October 23",
                        "description": [
                            "Responsive Post:",
                            "Write a two-hundred-word response to what you heard from Kyuboem Lee today on the under the W2 Responsive Post section found with the Modules tab.  What you specifically write about is up to you. It could involve something specific that they said which you clearly agreed with, or strongly disagreed with. It could surround something that the Spirit of God brought to your mind during the discussion, a question that you are left with after today’s interaction, or even regarding something specific that someone else in the cohort mentioned in the post-conversation cohort interaction."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Posts",
                    "time": "Thursday, By Midnight, October 24,",
                    "description": [
                        "Today you will continue the conversation with your cohort with the Pathways digital platform based on yesterday’s conversation with Kyuboem Lee.  Please write today’s post by clicking on the Modules tab and then W2 Responsive Post."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Responding to Other Learners:",
                            "Write a fifty-word word response each, to three other learners’ posts from yesterday. Please add to the conversation with something more substantive than “Hey, you are right, and I agree with you- thanks!” Reflect (briefly) on something specific from their post that deeply spoke to you and why, or why you kindly disagree with them on a specific point that they made, or even how you may specifically attempt to implement their main idea within your own life or ministry. "
                        ]
                    }
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas ",
                    "time": "Friday & Saturday, October 25 & 26",
                    "description": [
                        "For these two days, we will carve out time to read some pieces and/or watch some video presentations from some essential thought leaders that have some relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Friday & Saturday:",
                        "Foolishness to the Greeks: The Gospel and Western Culture by Lesslie Newbigin (Chap. 1-3). Newbigin was a British missionary to India for decades and when he returned to the U.K. after his retirement, he realized that the West, itself, was a mission field. Newbigin was one of the first to see that Western culture was something other than a “Christian” culture and he sought to use his missiological thinking and training to imagine what ministry could be, and should be, within this context. The term “missional” originally came from Newbigin’s ideas."
                    ],
                    "assignment": {
                        "due": "Saturday, By Midnight, October 26",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W2 Personal Learning Reflection section under the Modules tab.",
                            "In particular, explore possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "Midnight, October 27",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Visiting “Post-Christian” Spaces:  Spend a minimum of 2 hours physically present, and deeply reflecting on some of the formative processes of the “secular spaces” listed below. Pay attention to the architecture, actions, assumed values, language, and aims of those who inhabit these contexts. Prayerfully consider how these contexts seek to form people around secular values and assumptions that serve as alternatives to following Jesus.",
                        "Possible Spaces:",
                        "Local Bar or Tavern",
                        "State University Campus Activity",
                        "Appointment with a “Secular” Therapist",
                        "A Military Event",
                        "Shopping Mall",
                        "Suburban Housing Development",
                        "Political Rally or Gathering"
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred word spiritual reflection, based on your experiences with the Spirit of Jesus today. Please type this into the W2 Personal Spiritual Reflection section under the Modules tab.",
                            "In particular, write about what Jesus may want to do, or may already be doing, within your personal life."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Learning & Spiritual Reflections",
                    "time": "",
                    "description": [
                        "COACHING THIS WEEK",
                        "Group Three and Four Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups One and Two: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss. The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "Midnight, October 28",
                        "description": [
                            "Today you will respond to cohort members’ learning reflections and spiritual reflections based on their posted reflections from Saturday and Sunday.",
                            "Post 1. Responding to Learning Reflections:",
                            "Write a fifty-word response each to three other cohort members’ learning reflections from Saturday. Aim at a critical engagement with their reflection. Something like: “I hear you saying _________, I think you are on to something with ____________, but I also think you need to consider ______________.” Please do not simply agree with them. In this exercise, you are ministering to your fellow learners by adding some perspective that they may be missing. They will not be formed the same way if you merely agree with everything within their reflection.",
                            "Post under Post 1 - Responding to Week 2 Personal Learning Reflections",
                            "Post 2. Responding to a Spiritual Reflection:",
                            "Write a brief response to one other cohort members’ spiritual reflection from Sunday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 2 - Responding to Week 2 Personal Spiritual Reflections"
                        ]
                    }
                },
                {
                    "name": "Learning From Others’ Feedback",
                    "time": "Tuesday, By Midnight, October 29",
                    "description": [
                        "Today, we will invest some time considering, and responding to the feedback we received from others regarding our Learning Reflection and on our Spiritual Reflection. The purpose of this exercise is for us to hear from God through the gifts and perspectives of others. (And to learn to humbly respond to the larger community of Jesus and not merely live as a Western individualist!)"
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Personal Learning Reflection- 2.0:",
                            "Edit your three-hundred-word learning reflection, based on the feedback you received from three cohort members. (Cut some things out, add other things- basically edit the document as if you took seriously the fellow students’ feedback and then re-post it under W2 Personal Learning Reflection 2.0 under Modules.",
                            "Personal Spiritual Reflection- 2.0:",
                            "Edit you two-hundred word spiritual reflection, based on the pastoral feedback you received from a cohort member. (Cut some things out, add other things- basically edit it as if you took to heart their counsel and then re-post it under W2 Personal Spiritual Reflections 2.0 under Modules."
                        ]
                    }
                }
            ]
        },
        {
            "week": "Week 3",
            "date": "October 30 - November 05",
            "leader": "Sarah Heath",
            "events": [
                {
                    "name": "(Live Zoom Session)",
                    "time": "Wednesday, October 30 1: 00 - 2: 30 PM EST",
                    "description": [
                        "Today we will have the opportunity to engage in an open Questions & Response session with Sarah Heath, for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask Sarah  regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together. Sarah will not be presenting any formal material but will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Responsive Post:",
                            "Write a two-hundred word response to what you heard from Sarah Heath today under the W3 Responsive Post section found with the Modules tab.  What you specifically write about is up to you. It could involve something specific that they said which you clearly agreed with, or strongly disagreed with. It could surround something that the Spirit of God brought to your mind during the discussion, a question that you are left with after today’s interaction, or even regarding something specific that someone else in the cohort mentioned in the post-conversation cohort interaction."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Posts ",
                    "time": "",
                    "description": [
                        "Today you will continue the conversation with your cohort with the Pathways digital platform based on yesterday’s conversation with Sarah Heath.  Please write today’s post by clicking on the Modules tab and then W3 Responsive Post."
                    ],
                    "assignment": {
                        "due": "Midnight, October 31,",
                        "description": [
                            "Responding to Other Learners:",
                            "Write a fifty-word word response, to three other learners’ posts from yesterday. Please add to the conversation with something more substantive than “Hey, you are right, and I agree with you- thanks!” Reflect (briefly) on something specific from their post that deeply spoke to you and why, or why you kindly disagree with them on a specific point that they made, or even how you may specifically attempt to implement their main idea within your own life or ministry."
                        ]
                    }
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas ",
                    "time": "",
                    "description": [
                        "For these two days, we will carve out time to read some pieces and/or watch some video presentations from some essential thought leaders that have some relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Friday & Saturday:",
                        "Foolishness to the Greeks: The Gospel and Western Culture by Lesslie Newbigin (Chap. 4-6). Newbigin was a British missionary to India for decades and when returned to the U.K. after his retirement, he realized that the West, itself, was a mission field. Newbigin was one of the first to see that Western culture was something other than a “Christian” culture and he sought to use his missiological thinking and training to imagine what ministry could be, and should be, within this context. The term “missional” originally came from Newbigin’s ideas. ",
                        "David Zahl- “Seculosity” video interview. The culture observer discusses how human beings have a persistent religious impulse and how, in our present culture, that energy gets placed into everyday experiences and pursuits.  https: //www.youtube.com/watch?v=1k38Tkx2Uz8"
                    ],
                    "assignment": {
                        "due": "By Midnight, November 2",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W3 Personal Learning Reflection section under the Modules tab.",
                            "In particular, explore possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Spend some time slowly, and prayerfully, meditating on Luke 14: 13-30 and Luke 23: 13-25. Imagine, if you were present, how Jesus’s hometown and larger society- responded to his identity and vocation. After some time, in open prayer before God, consider your reputation and relationship to those within your local community and peers of your generation. How does your reputation match up to that of Jesus’s? Why? How much does your reputation matter to you? Why?"
                    ],
                    "assignment": {
                        "due": "Midnight, November 3",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred-word spiritual reflection, based on your experiences with the Spirit of Jesus today. Please type this into the W3 Personal Spiritual Reflection section under the Modules tab. In particular, write about what Jesus may want to do, or may already be doing, within your personal life."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Learning & Spiritual Reflections",
                    "time": "",
                    "description": [
                        "COACHING THIS WEEK",
                        "Group One and Two Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups Three and Four: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss. The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "Midnight, November 4",
                        "description": [
                            "Post 1. Responding to Learning Reflections:",
                            "Write a fifty-word response each to three other cohort members’ learning reflections from Saturday. Aim at a critical engagement with their reflection. Something like: “I hear you saying _________, I think you are on to something with ____________, but I also think you need to consider ______________.” Please do not simply agree with them. In this exercise, you are ministering to your fellow learners by adding some perspective that they may be missing. They will not be formed the same way if you merely agree with everything within their reflection. ",
                            "Post under Post 1 - Responding to Week 3 Personal Learning Reflections",
                            "Post 2. Responding to a Spiritual Reflection:",
                            "Write a brief response to one other cohort members’ spiritual reflection from Sunday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 2 - Responding to Week 3 Personal Spiritual Reflections"
                        ]
                    }
                },
                {
                    "name": "Learning From Others’ Feedback",
                    "time": "",
                    "description": [
                        "Today, we will invest some time considering, and responding to the feedback we received from others regarding our Learning Reflection and on our Spiritual Reflection. The purpose of this exercise is for us to hear from God through the gifts and perspectives of others. (And to learn to humbly respond to the larger community of Jesus and not merely live as a Western individualist!)"
                    ],
                    "assignment": {
                        "due": "Midnight, November 5",
                        "description": [
                            "Personal Learning Reflection- 2.0:",
                            "Edit your three-hundred word learning reflection, based on the feedback you received from three cohort members. (Cut some things out, add other things- basically edit the document as if you took seriously the fellow students’ feedback and then re-post it under W3 Personal Learning Reflection 2.0 under Modules.",
                            "Personal Spiritual Reflection- 2.0:",
                            "Edit you two-hundred word spiritual reflection, based on the pastoral feedback you received from a cohort member. (Cut some things out, add other things- basically edit it as if you took to heart their counsel and then re-post it under W3 Personal Spiritual Reflections 2.0 under Modules."
                        ]
                    }
                }
            ]
        },
        {
            "week": "Week 4",
            "date": "November 6-12",
            "leader": "David Zahl",

            "events": [
                {
                    "name": "Engaging & Responding to a Thought Leader",
                    "time": "November 6, 1: 00 - 2: 30 EST",
                    "description": [
                        "Today we will have the opportunity to engage in an open Questions & Response session with David Zahl, for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask David regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together.  David will not be presenting any formal material but will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant."
                    ],
                    "assignment": {
                        "due": "November 6",
                        "description": [
                            "Responsive Post:",
                            "Write a two-hundred-word response to what you heard from David Zahl today under the W4 Responsive Post section found with the Modules tab. What you specifically write about is up to you. It could involve something specific that they said which you clearly agreed with, or strongly disagreed with. It could surround something that the Spirit of God brought to your mind during the discussion, a question that you are left with after today’s interaction, or even regarding something specific that someone else in the cohort mentioned in the post-conversation cohort interaction."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Posts",
                    "time": "",
                    "description": [
                        "Today you will continue the conversation with your cohort with the Pathways digital platform based on yesterday’s conversation with David Zahl.  Please write today’s post by clicking on the Modules tab and then W4 Responsive Post."
                    ],
                    "assignment": {
                        "due": "Thursday, By Midnight, November 7",
                        "description": [
                            "Responding to Other Learners:",
                            "Write a fifty-word word response each to three other learners’ posts from yesterday. Please add to the conversation with something more substantive than “Hey, you are right, and I agree with you- thanks!” Reflect (briefly) on something specific from their post that deeply spoke to you and why, or why you kindly disagree with them on a specific point that they made, or even how you may specifically attempt to implement their main idea within your own life or ministry."
                        ]
                    }
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas",
                    "time": "Friday & Saturday, November 8 & 9",
                    "description": [
                        "For these two days, we will carve out time to read some pieces and/or watch some video presentations from some essential thought leaders that have some relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Friday & Saturday:",
                        "James K. A. Smith- “Charles Taylor and Our Secular Age” video lecture. Smith explores the implications of Canadian philosopher Charles Taylor’s influential book- A Secular Age.",
                        "http: //intersectproject.org/faith-and-culture/james-k-a-smith-charles-taylor-and-our-secular-age/",
                        "William Cavanaugh- “The Myth of Religious Violence” video lecture. Cavanaugh, a theologian, speaks on the secular assumption that “religion is inherently violent” and uses this cliché to expose how secularism, itself, acts like an alternative religion.",
                        "https: //www.youtube.com/watch?v=9XaGlo-LZHg",
                        "Pew Research Center, Religious Landscape Study: Racial and Ethnic Composition. Tables and charts that breakdown religious preferences, practices, and belief patterns from persons of different racial and ethnic backgrounds.",
                        "https: //www.pewforum.org/religious-landscape-study/racial-and-ethnic-composition/",
                        "Race and secularism (article). A brief review of the fascinating book which claims that whiteness and secularism are two sides of the same coin.",
                        "https: //tif.ssrc.org/2016/10/17/race-and-secularism-in-america/"
                    ],
                    "assignment": {
                        "due": "November 9,  2019 (at midnight)",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W4 Personal Learning Reflection section under the Modules tab.",
                            "In particular, explore possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Spend some time exploring two different accounts of early church public ministry found in the book of Acts. In one account, we find Peter preaching to a group of Jewish people- Acts 2: 14-41. This is a group whom already believes in the God of the Bible, who are well acquainted with the Hebrew Scriptures (Old Testament), and at a minimum, have a respect for traditional faith. In the other story, Paul is communicating with a bunch of highly educated Greeks- Acts 17: 16-34. This is a group who are unfamiliar with the Jewish scriptures, customs, and understanding of God.",
                        "Compare and contrast Peter and Paul’s communicative approaches to these two groups. What language did they use? Sources did they cite? How did they appeal to their listeners? Call them to Jesus? Etc.",
                        "Afterwards, take time to consider whose approach to ministry do you most clearly emulate and why?"
                    ],
                    "assignment": {
                        "due": "Sunday, By Midnight, November 10",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred-word spiritual reflection, based on your experiences with the Spirit of Jesus today. Please type this into the W4 Personal Spiritual Reflection section under the Modules tab. In particular, write about what Jesus may want to do, or may already be doing, within your personal life."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Learning & Spiritual Reflections",
                    "time": "",
                    "description": [
                        "COACHING THIS WEEK",
                        "Group Three and Four Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups One and Two: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss.  The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "Monday, By Midnight, November 11",
                        "description": [
                            "Post 1. Responding to Learning Reflections:",
                            "Write a brief response to three other cohort members’ learning reflections from Saturday. Aim at a critical engagement with their reflection. Something like: “I hear you saying _________, I think you are on to something with ____________, but I also think you need to consider ______________.” Please do not simply agree with them. In this exercise, you are ministering to your fellow learners by adding some perspective that they may be missing. They will not be formed the same way if you merely agree with everything within their reflection. ",
                            "Post under Post 1 - Responding to Week 4 Personal Learning Reflections.",
                            "Post 2. Responding to a Spiritual Reflection:",
                            "Write a brief response to one other cohort members’ spiritual reflection from Sunday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 2 - Responding to Week 4 Personal Spiritual Reflections."
                        ]
                    }
                },
                {
                    "name": "Learning From Others’ Feedback",
                    "time": "",
                    "description": [
                        "Today, we will invest some time considering, and responding to the feedback we received from others regarding our Learning Reflection and on our Spiritual Reflection. The purpose of this exercise is for us to hear from God through the gifts and perspectives of others. (And to learn to humbly respond to the larger community of Jesus and not merely live as a Western individualist!)"
                    ],
                    "assignment": {
                        "due": "Midnight, November 12",
                        "description": [
                            "Personal Learning Reflection- 2.0:",
                            "Edit your three-hundred word learning reflection, based on the feedback you received from three cohort members. (Cut some things out, add other things- basically edit the document as if you took seriously the fellow students’ feedback and then re-post it under W4 Personal Learning Reflection 2.0 under Modules.",
                            "Personal Spiritual Reflection- 2.0:",
                            "Edit you two-hundred word spiritual reflection, based on the pastoral feedback you received from a cohort member. (Cut some things out, add other things- basically edit it as if you took to heart their counsel and then re-post it under W4 Personal Spiritual Reflections 2.0 under Modules."
                        ]
                    }
                }
            ]
        },
        {
            "week": "Week 5",
            "date": "November 13 - 19",
            "leader": "Mockingbird",

            "events": [
                {
                    "name": "Engaging & Responding to a Thought Leader",
                    "time": "November 13, 1: 00 - 2: 30 EST ",
                    "description": [
                        "Today we will have the opportunity to engage in an open Questions & Response session with Mandy Smith, for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask Mandy regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together. Mandy will not be presenting any formal material but will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant."
                    ],
                    "assignment": {
                        "due": "Midnight, November 13",
                        "description": [
                            "Responsive Post:",
                            "Write a two-hundred-word response to what you heard from Mandy Smith today under the W5 Responsive Post section found with the Modules tab.  What you specifically write about is up to you. It could involve something specific that they said which you clearly agreed with, or strongly disagreed with. It could surround something that the Spirit of God brought to your mind during the discussion, a question that you are left with after today’s interaction, or even regarding something specific that someone else in the cohort mentioned in the post-conversation cohort interaction."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Posts",
                    "time": "November 14",
                    "description": [
                        "Today you will continue the conversation with your cohort with the Pathways digital platform based on yesterday’s conversation with Mandy Smith.  Please write today’s post by clicking on the Modules tab and then W5 Responsive Post."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Responding to Other Learners:",
                            "Write a fifty-word word response each to three other learners’ posts from yesterday. Please add to the conversation with something more substantive than “Hey, you are right, and I agree with you- thanks!” Reflect (briefly) on something specific from their post that deeply spoke to you and why, or why you kindly disagree with them on a specific point that they made, or even how you may specifically attempt to implement their main idea within your own life or ministry. "
                        ]
                    }
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas",
                    "time": "Friday & Saturday, November 15 & 16,",
                    "description": [
                        "For these two days, we will carve out time to read some pieces and/or watch some video presentations from some essential thought leaders that have some relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Friday & Saturday:",
                        "The Myth of Secular- Pt. 6- John Milbank. The British theologian, in an interview with the CBC, explains his unique perspective on modern secularism. ",
                        "https: //www.cbc.ca/radio/ideas/the-myth-of-the-secular-part-6-1.2920704",
                        "Interview with Rodney Stark. The sociologist discusses his research on how and why the early church overtook the Roman Empire. ",
                        "https: //touchstonemag.com/archives/article.php?id=13-01-044-i",
                        "Two Chapters from Rodney Stark’s The Rise of Christianity. Stark explains, based on research, how and why conversion actually happens.",
                        "https: //www.humanscience.org/docs/Stark%20(1996)%20Rise%20of%20Christianity%201-2.pdf",
                        "Rethinking Evangelism- Dallas Willard. The late spiritual writer and philosopher offers a different angle on evangelism and the church.",
                        "http: //www.dwillard.org/articles/individual/rethinking-evangelism",
                        "Apologetics in Action- Dallas Willard. The popular thinker engages in brief role play regarding difficult questions posed by a young person when it comes to Jesus.",
                        "http: //www.dwillard.org/articles/individual/apologetics-in-action",
                        "Behold, the Millennial Nuns by Eve Fairbanks. The author explores the sudden rise of young women entering convents and what it may say about our cultural moment.",
                        "https: //www.huffpost.com/highline/article/millennial-nuns/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAKa8WNUf6fXLJW7ySWOcPF0cQcZsMVhtGtHXad0QK_Y2NU6DAXJ5exvejR5i62h4BSgjr803GGsMTaOHtCT2Or92UON7vje0onALa9w2PWD3-wAOecDbJwliHOaJiesaFuc619T8XO_SsDLUgIzNEnhevNxLVHQfpzkHshmKuFBL",
                        "Breaking Faith- Peter Beinhart. The writer suggests that when religion practically disappears from a culture, that political tensions increase rather than decrease.",
                        "https: //www.theatlantic.com/magazine/archive/2017/04/breaking-faith/517785/"
                    ],
                    "assignment": {
                        "due": "Midnight, November 16",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred-word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W5 Personal Learning Reflection section under the Modules tab.  In particular, explore possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Hanging out with a “non-believer”:  Get together with someone, one-on-one, whom as far as you know, is NOT a Jesus follower. You are NOT expected to share your faith with them, however, if spirituality comes up, that’s great! Most importantly, spend time deeply listening to them. Listen to the “words beneath their words”. Work hard at being kind, attentive, and an empathetic ear. Afterwards, prayerfully reflect on the details of your friend’s life, their needs and struggles, and how the Spirit of Jesus could possibly use you to bless them moving forward."
                    ],
                    "assignment": {
                        "due": "Sunday, By Midnight, November 17",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred word spiritual reflection, based on your experiences with the Spirit of Jesus today. Please type this into the W5 Personal Spiritual Reflection section under the Modules tab.  In particular, write about what Jesus may want to do, or may already be doing, within your personal life."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Learning & Spiritual Reflections",
                    "time": "",
                    "description": [
                        "COACHING THIS WEEK ",
                        "Group One and Two Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups Three and Four: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss. The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "Midnight, November 18",
                        "description": [
                            "Post 1. Responding to Learning Reflections:",
                            "Write a brief response to three other cohort members’ learning reflections from Saturday. Aim at a critical engagement with their reflection. Something like: “I hear you saying _________, I think you are on to something with ____________, but I also think you need to consider ______________.” Please do not simply agree with them. In this exercise, you are ministering to your fellow learners by adding some perspective that they may be missing. They will not be formed the same way if you merely agree with everything within their reflection. ",
                            "Post under Post 1 - Responding to Week 5 Personal Learning Reflections",
                            "Post 2. Responding to a Spiritual Reflection:",
                            "Write a brief response to one other cohort members’ spiritual reflection from Sunday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 2 - Responding to Week 5 Personal Spiritual Reflections"
                        ]
                    }
                },
                {
                    "name": "Learning From Others’ Feedback",
                    "time": "Midnight, November 19",
                    "description": [
                        "Today, we will invest some time considering, and responding to the feedback we received from others regarding our Learning Reflection and on our Spiritual Reflection. The purpose of this exercise is for us to hear from God through the gifts and perspectives of others. (And to learn to humbly respond to the larger community of Jesus and not merely live as a Western individualist!)"
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Personal Learning Reflection- 2.0:",
                            "Edit your three-hundred word learning reflection, based on the feedback you received from three cohort members. (Cut some things out, add other things- basically edit the document as if you took seriously the fellow students’ feedback and then re-post it under W5 Personal Learning Reflection 2.0 under Modules.",
                            "Personal Spiritual Reflection- 2.0:",
                            "Edit you two-hundred word spiritual reflection, based on the pastoral feedback you received from a cohort member. (Cut some things out, add other things- basically edit it as if you took to heart their counsel and then re-post it under W5 Personal Spiritual Reflections 2.0 under Modules."
                        ]
                    }
                }
            ]
        },
        {
            "week": "Week 6",
            "date": "November 20 - 26 ",
            "leader": "Mandy Smith",
            "events": [
                {
                    "name": "Engaging & Responding Around the Ministry Vision Assignment",
                    "time": "November 20 1: 00 - 2: 30 PM EST ",
                    "description": [
                        "Today we will have the opportunity to engage prepare for our ‘Vision: A Church with Secular People In Mind’ assignment.",
                        "Vision: A Church with Secular People in Mind. In light of what you’ve learned in this Online Learning Collective, how might your specific church more effectively minister to post-christian, secular people? Prayerfully imagine how your church, if living like a missionary community within a secular culture, might engage in public worship, outreach and connections, spiritual formation and disciple-making, justice work for the poor, fellowship groups, leadership development, etc. ",
                        "In addition, we will have the opportunity to engage in an open Questions & Response session with Jon Hand for forty-five minutes to one hour, regarding issues involved with ministry leadership in a post-Christian context. Afterwards, we will also spend some time interacting together in small groups, and as a whole cohort, on what we heard from them for another thirty to forty-five minutes. You will also post a personal response by midnight.",
                        "Preparation:",
                        "Come prepared with one or two questions to ask Jon Hand regarding ministry within a post-Christian culture. The specific nature of your questions is up to you- but we encourage you to have one or two written down before our Zoom session together. Jon will not be presenting any formal material but will engage with us based on the questions we ask. We would also encourage you to take notes during the conversation as they seem relevant.",
                        "NO ‘Thought Leader’ Response Post Assignment due this week"
                    ],
                    "assignment": null
                },
                {
                    "name": "Learning From and Reflecting on Key Ideas",
                    "time": "Thursday, November 21",
                    "description": [
                        "For these two days, we will carve out time to listen to podcasts from some essential thought leaders that have some relevance to pastoring within a post-Christian context. (Though the direct application to your ministry may require some of your creativity and the Spirit’s inspiration.) This will culminate with you writing and posting a personal learning reflection.",
                        "Learning Material for Thursday and Friday:",
                        "Listen to Season 1, Season 2 (only episodes 1-3), and Season 3 of the This Cultural Moment Podcast featuring John Mark Comer and Mark Sayers. The church planters, from Portland, Oregon and Melbourne, Australia, analyze contemporary secular culture and what it means to faithfully follow Jesus within this cultural context. https: //thisculturalmoment.podbean.com/page/3/"
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Personal Learning Reflection:",
                            "Write a three-hundred-word learning reflection, based on the texts and/or videos assigned for this weekend. Please type this into the W6 Personal Learning Reflection section under the Modules tab. In particular, explore possible implications of the assigned learning material for your specific ministry and/or personal life."
                        ]
                    }
                },
                {
                    "name": "Learning From Spiritual Experiences",
                    "time": "",
                    "description": [
                        "Today, we will invest some time in prayer, meditation, and/or spiritual practices. These will culminate with you writing and posting a personal spiritual reflection.",
                        "Spiritual Practice(s):",
                        "Begin your time quieting yourself in still and silent prayer- concentrating on the presence of God and asking the Spirit of Jesus to speak to you.",
                        "Then, quietly but thoroughly, read through everything that you have written or posted through this intensive. Read your forum posts, your WORD documents, before and after the comments from others. Read through any and all personal notes you took through these six-weeks together.",
                        "Afterwards, closeup all your notes and go back to still and silent prayer. Ask God what specifically the Spirit has to say to you, personally, through this learning intensive, and why. Sit in silence and pay attention to what comes to mind- to what God says to you."
                    ],
                    "assignment": {
                        "due": "Saturday, By Midnight, November 23",
                        "description": [
                            "Personal Spiritual Reflection:",
                            "Write a two-hundred word spiritual reflection, based on your experiences with the Spirit of Jesus today. (Please save it as a WORD document and upload it to the Please type this into the W6 Personal Spiritual Reflection section under the Modules tab.  In particular, write about what Jesus may want to do, or may already be doing, within your personal life."
                        ]
                    }
                },
                {
                    "name": "Responding to Other Cohort Members’ Spiritual Reflections & Writing a Ministry Vision Assignment",
                    "time": "November 24",
                    "description": [
                        "Today you will respond to cohort members’ spiritual reflections based on their posted reflection from Saturday and write and post about your future hopes for your local ministry."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": [
                            "Post 1. Responding to a Spiritual Reflections:",
                            "Write a brief response to TWO other cohort members’ spiritual reflection from Saturday. Aim at adding something to them- pastorally. Here you are ministering to your fellow learner by adding some personal encouragement and/or ministerial wisdom to them as an individual.",
                            "Post under Post 1 - Responding to Week 6 Spiritual Reflection",
                            "Post your response by Midnight tonight.",
                            "Post 2. Ministry Vision Assignment",
                            "Imagining What Your Church Could Become: In light of what you’ve learned in this Online Learning Collective, how might your church more effectively minister to post-Christian, secular people? Prayerfully imagine how your church community, if living like a missionary community within a secular culture, might engage in public worship, outreach and connections, spiritual formation and disciple-making, justice work for the poor, fellowship groups, leadership development, etc. ",
                            "Write a 500-word vision description, of what your ministry could specifically do differently, to more effectively engage secular people.",
                            "Post under Post 2 - Ministry Vision Assignment"
                        ]
                    }
                },
                {
                    "name": "Closing Community Experience",
                    "time": "Tuesday, November 26 1: 00 - 4: 00 PM EST",
                    "description": [
                        "During this final connection point- we will invest 90 minutes to engage with your dreams of how your ministry could possibly serve as a more effective community of mission within a post-christian culture. We will also invest another 90 minutes exploring how Jesus showed up within our lives over the learning intensive, hearing your suggestions for the Jesus Collective moving forward, and spending some time in prayer together. ",
                        "Preparation:",
                        "Come ready to share your vision document for your local ministry and on the Spirit of Jesus moved within your life during this cohort experience."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": []
                    }
                },
                {
                    "name": "Coaching further out beyond Thanksgiving",
                    "time": "",
                    "description": [
                        "COACHING THIS WEEK  - Optional",
                        "Due to the US Thanksgiving Holiday this week triads and personal coaching will not happen until after the following week.  Therefore we have made these optional but would strongly encourage you to engage in this opportunity.  Your participation must be confirmed today.  Lack of confirmation will be taken as not participating.",
                        "Group Three and Four Coaching:  This week you will meet with your assigned facilitated triad for the first of three 1.5 hour long sessions that occur every other week.  The time slot for your Group Coaching was sent to you in your welcome package.",
                        "Personal Coaching for Groups One and Two: This week you will meet with your personal coach for the first of three sessions that occur every other week.  The coaching session will be 1.25 hours and is focused around a personal challenge that has surfaced in the past week as it relates to the a.) the course, b.) your ministry context, or c.) your personal / professional life. All coaching sessions are confidential. You will need to come to the coaching session with at least one clear item you would like to discuss. The time slot for your coaching was confirmed by email through the You Can Book Me app."
                    ],
                    "assignment": {
                        "due": "October 16",
                        "description": []
                    }
                }
            ]
        }
    ]
}