[
  "This is a legally binding agreement between you (either an individual or a single entity), referred to herein as “YOU” and JESUS COLLECTIVE.  The “One Story Kids and Youth Curriculum” and all documents and materials included in it are referred to herein as the “CURRICULUM”. YOU acknowledge that the CURRICULUM is the property of The Meeting House Church Family (hereinafter “TMHCF”) and that TMHCF has appointed JESUS COLLECTIVE as its exclusive distributor of the CURRICULUM.  TMHCF has authorized JESUS COLLECTIVE the right to distribute and sub-license the CURRICULUM to end-users.  Downloading or using all or any portion of this CURRICULUM indicates your acceptance of all the terms and conditions of this End-User License Agreement referred to herein as “EULA” and that this agreement is equivalent to a written agreement signed by you.  By selecting the box “I AGREE” or performing a similar electronic function, you are providing your acceptance of the terms of this agreement.  This agreement is enforceable against you and any legal entity that obtains the CURRICULUM and on whose behalf it is used.  If you do not agree to the terms of this agreement, please do not use this CURRICULUM.",
  "",
  "IT IS ILLEGAL AND STRICTLY PROHIBITED TO DISTRIBUTE, PUBLISH, OFFER FOR SALE, LICENSE OR SUBLICENSE, GIVE OR DISCLOSE TO ANY OTHER PARTY, THIS CURRICULUM IN HARD COPY, DIGITAL FORM OR ANY OTHER MEDIUM WHETHER EXISTING OR NOT YET EXISTING, EXCEPT AS SPECIFICALLY PERMITTED BELOW.",
  "",
  "The use of this CURRICULUM is governed by the terms and conditions set forth herein.  Please read them carefully, This EULA is applicable to all of the media files and documents included in the CURRICULUM and to the CURRICULUM in its whole part.  You are deemed to have read, understood and accepted the terms of this EULA when you download or use the CURRICULUM.",
  "",
  "LIMITED LICENSE.  You are granted a limited, non-exclusive license to download the CURRICULUM  from the JESUS COLLECTIVE platform for the purpose of educating children and youth digitally or in person within a family, school, church, or ministry setting, provided that YOU do not render the CURRICULUM accessible to other users through local or Internet networks or other methods.  This limited non-exclusive license is non-transferable: it may only be used by users within the same family, church or ministry organization. Use by any other person, company, affiliate, corporation, Limited Liability Company, trust, or other separate legal entity will require a separate license.  This limited, non-exclusive license will automatically renew annually on the anniversary date of the EULA, unless terminated by YOU or JESUS COLLECTIVE. All protections with which JESUS COLLECTIVE are provided under the EULA shall survive the termination of your license to use the CURRICULUM. YOU acknowledge that in the event that the Curriculum Distribution Agreement between TMHCF and JESUS COLLECTIVE is terminated during the term of the EULA, or any annual renewal thereof, YOU will be entitled to continue to use the CURRICULUM in accordance with this EULA until the next following annual renewal date of the EULA; thereafter, YOU will be required to enter into a EULA directly with TMHCF or its authorized distributor.",
  "",
  "2. PROPRIETARY RIGHTS. TMHCF and its suppliers retain all title, ownership, and intellectual property rights in the CURRICULUM, including but not limited to all supporting documentation, files, marketing material, images, multimedia and applets.  The CURRICULUM is protected by copyright and other intellectual property laws and by international treaties.  The CURRICULUM may include security measures designed to control access and prevent unauthorized copying and use.  You agree not to interfere with any such security components.  JESUS COLLECTIVE permits you to download, use or otherwise benefit from the functionality or intellectual property of the CURRICULUM only in accordance with the terms of this EULA.  Use of third party material included in the CURRICULUM may be subject to the terms and conditions typically found in the party’s own license agreement.",
  "",
  "3. CONFIDENTIALITY. Any use or disclosure of the Curriculum, other than in strict accordance with this EULA may be actionable as a violation of TMHCF’s trade secret rights.",
  "",
  "4. NON-TRANSFER OF RIGHTS. You may not rent, lease, sell, sublicense, assign or transfer your rights in the CURRICULUM, or authorize any portion of the CURRICULUM to be copied or used by any person outside of your family, church or ministry organization.",
  "",
  "5. ALLOWED USAGE. Upon fulfilling your obligations towards properly downloading and registering the CURRICULUM or obtaining a valid CURRICULUM User ID, you are permitted to use the CURRICULUM for the purpose of educating children and youth digitally or in person within a family, school, church, or ministry setting.",
  "",
  "6. DISTRIBUTION. You may not: (i) modify or create any derivate works of the CURRICULUM, including customization, any modifications or enhancements, without JESUS COLLECTIVE’s express written consent; (ii) attempt to gain unauthorized access to the CURRICULUM, TMHCF’S servers or any other service, account, computer system or network associated with the CURRICULUM or with TMHCF, it’s affiliates, agents, partners and customers; (iii) remove or alter any trademark, logo, copyright or other proprietary notices or symbols in the CURRICULUM; (iv) block, disable, or otherwise affect any advertising, banner window, tab, link to websites and services, or other features that are part of the CURRICULUM; (v) incorporate, integrate or otherwise include the CURRICULUM or any portion thereof into any program or product; (vi) provide false information when registering the CURRICULUM; (vii) digitally transmit or make available the Curriculum or its contents through local networks, intranets, extranets, FTP, online discussion boards, forums, list-serve, peer-to-peer networks or technologies, newsgroups, bulletin boards, or another mode of shared communication system, or place the CURRICULUM onto a server so that it is accessible via a public network such as the Internet; (viii) use the CURRICULUM in any way that violates this EULA or any law; or (ix) authorize or assist any third party to do any of the things described in this section.",
  "",
  "7. CURRICULUM USER ID.  Use of the CURRICULUM requires an authorized User ID and password.  You agree not to share or transfer this User ID or password to other parties who are not part of your organization and are not a party to this EULA.",
  "",
  "8. PRIVACY.  During the download process, or at some time thereafter, you may be asked to provide certain information to JESUS COLLECTIVE.  All personal and billing information is transmitted using the secure SL protocol.  Both personal and non-personal information collected is safeguarded according to the highest privacy and data protection standards adopted worldwide.  YOU agree and consent to JESUS COLLECTIVE collecting statistical information from YOU concerning families, churches, schools and ministry organizations using the CURRICULUM and sharing such information with TMHCF. Other than the foregoing, personal and non-personal information collected will not be shared or given without your consent as described in our Privacy Policy which may be found at www.onestorycurriculum.com.",
  "",
  "9. LIMITATION OF LIABILITY.  EXCEPT AS REQUIRED BY LAW, NEITHER TMHCF NOR JESUS COLLECTIVE AND THEIR EMPLOYEES, DIRECTORS, LICENSORS, CONTRIBUTORS AND AGENTS WILL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR EXEMPLARY DAMAGES ARISING OUT OF OR IN ANY WAY RELATING TO THIS EULA OR THE USE OF OR INABILITY TO USE THE SOFTWARE, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, LOST PROFITS, LOSS OF DATA, AND COMPUTER FAILURE OR MALFUNCTION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES AND REGARDLESS OF THE THEORY (CONTRACT, TORT OR OTHERWISE) UPON WHICH SUCH CLAIM IS BASED. TMHCF’S LIABILITY UNDER THIS EULA IS LIMITED TO REPLACEMENT OF A DIGITAL MEDIUM CONTAINING THE CURRICULUM.",
  "",
  "10. DISCLAIMER OF WARRANTY.  YOU ACCEPT THE CURRICULUM “AS IS” AND WITH ALL FAULTS (IF ANY).  JESUS COLLECTIVE DISCLAIMS ALL WARRANTIES EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A  PARTICULAR PURPOSE.  TMHCF MAKES NO WARRANTY OR REPRESENTATIONS WHATSOEVER REGARDING THE CONTENT OF CURRICULUM AND YOUR USE OF THE CURRICULUM, OR THE SUITABILITY OF THE CURRICULUM TO MEET YOUR SPECIFIC NEEDS.  THERE MAY BE LAWS APPLICABLE IN YOUR STATE OR PROVINCE THAT NEED TO BE ADDRESSED.",
  "",
  "JESUS COLLECTIVE makes no warranties with respect to the CURRICULUM as described above and as such, there should be no reason for you to bring any grievance against JESUS COLLECTIVE.  However, if you do bring any action, claim, suit, threat or demand against JESUS COLLECTIVE, and you do not substantially prevail, you shall pay JESUS COLLECTIVE’s entire legal fees and costs attached to such action.  In the same manner, if JESUS COLLECTIVE is forced to take legal action to enforce this EULA or any of its rights described herein or under any state or federal law, you will pay JESUS COLLECTIVE’s legal fees and costs.",
  "",
  "11. VIOLATIONS OF THIS EULA. JESUS COLLECTIVE reserves all rights not specifically granted to you above.  JESUS COLLECTIVE will have the right to proceed against you in the event that you infringe against JESUS COLLECTIVE’s rights.  Any use not within the precise scope of the license set forth herein will be considered an infringement  You acknowledge and agree that JESUS COLLECTIVE’s damages in the event of your violation of this EULA will be substantial and that JESUS COLLECTIVE will suffer irreparable harm in such event.  As such, JESUS COLLECTIVE shall have the right to obtain equitable remedies, including but not limited to recovery of damages, obtaining injunctions, recovering statutory damages, recovering legal fees, and any other available legal remedy.",
  "",
  "12. TERMINATION.  JESUS COLLECTIVE shall have the sole and exclusive right to immediately terminate this EULA and suspend your license to use the CURRICULUM should you fail to perform any obligation required under this EULA, engage in activity that JESUS COLLECTIVE deems harmful to its well-being or if you become bankrupt or insolvent.  This EULA takes effect upon your download of the CURRICULUM and remains effective until terminated.  Upon termination of this EULA, you shall cease to use the CURRICULUM and shall remove any copies of the CURRICULUM from any and all computers upon which the CURRICULUM has been used. If at any time during the term of this EULA the Curriculum Distribution Agreement entered into between TMHCF and JESUS COLLECTIVE is terminated or JESUS COLLECTIVE is dissolved, you acknowledge and agree that JESUS COLLECTIVE shall have the right to unilaterally assign its rights under this EULA to TMHCF for the remainder of the term of the EULA. In that event, all references to JESUS COLLECTIVE in this EULA shall be read as referring to TMHCF for the purposes of interpreting this EULA.",
  "",
  "13. WAIVER & SEVERABILITY.  JESUS COLLECTIVE’s waiver of any breach of this EULA shall not constitute an amendment to this EULA or JESUS COLLECTIVE’s waiver of subsequent breaches.  If any part of this EULA is found void and unenforceable, it will not affect the validity of the balance of this EULA, which will remain valid and enforceable according to its terms.",
  "",
  "14. ELECTRONIC NOTICES. You consent that JESUS COLLECTIVE may provide you with information and notices regarding the CURRICULUM and JESUS COLLECTIVE via the email address you designate when downloading the CURRICULUM or thereafter.  JESUS COLLECTIVE may provide notices to you via (i) email if you have provided JESUS COLLECTIVE with a valid email address, or (ii) by posting the notice on JESUS COLLECTIVE’s website or the CURRICULUM  download site which JESUS COLLECTIVE owns and operates.  You may withdraw your consent for electronic notices.",
  "",
  "15. AMENDMENTS.  JESUS COLLECTIVE reserves the right to unilaterally amend all offers, pricing terms or other matters pertaining to the CURRICULUM, JESUS COLLECTIVE’s website or this EULA.  No course of dealing or trade usage shall be deemed to amend the terms of this EULA.",
  "",
  "16. GOVERNING LAW. This EULA shall be governed by and construed under the laws of Ontario and the laws of Canada applicable therein.  You consent and agree that all proceedings relating to the subject matter of this EULA shall be maintained in courts sitting within the Province of Ontario (Canada) and that jurisdiction and venue for such proceedings shall lie exclusively with such courts.",
  "",
  "17. COMPLETE AGREEMENT.  This is the entire EULA between JESUS COLLECTIVE and you relating to the CURRICULUM and it supersedes any prior representations, discussions, undertakings, warranties, communications or advertising relating to the CURRICULUM."
]
